{
  "articles": [
    {
      "title": "সেই মহাগ্রন্থটির প্রারম্ভিকা",
      "body": [
        "কী সুন্দর এই সৃষ্টি! কী নিপুণ এই কারুকার্য এবং নিখুঁত তার নকশা! কত উপকরণ সজ্জিত করে আমাদের জীবন ভরে দিয়েছেন আমাদের প্রতিপালক। সবই শুধু আমাদের জন্য। তিনি নিজে এর জন্য কোনো প্রতিদানও নেন না। তিনি তো সবকিছু থেকে অমুখাপেক্ষী। এইযে এই সুন্দর কারুকার্য, সুন্দর বাসভূবন, তা তো তিনি শুধু আমাদেরকে একটুখানি ভাববার জন্য দিয়েছেন; এই ধরার ক্ষণস্থায়ী জীবনটাই এতো সুন্দর! না জানি পরকালের সীমাহীন অনন্তকালের জীবন কত সুন্দর ও মজাদার হবে! হ্যা, এই ভাবনাটার জন্যই এত সৌন্দর্য, এত নিপুণতা। পরকালীন সেই সুখ ও সৌন্দর্য উপভোগের জন্য চাই একটু আনুগত্য, একটু ত্যাগ। এই ত্যাগের শিক্ষা নেওয়ার জন্য আল্লাহ তাআলা, আমাদের প্রতিপালক, আমাদের জন্য একটি জীবনব্যবস্থা দিয়ে দিয়েছেন। এই জীবনব্যবস্থার বাস্তব রূপ হিসেবে আল-কুরআনকে কিতাবরূপে (বইরূপে) প্রেরণ করেছেন আমাদের জন্য। এই বইটির প্রারম্ভিকা নিয়ে কিছু বলার ইচ্ছা পোষণ করছি আজকে। আল্লাহ আমার সহায় হোন।",
        "শুরুতেই তার মূল রূপ এবং আমাদের মাতৃভাষায় তার অর্থ বলি।",
        "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ ",
        "পরম করুণাময় ও অসীম দয়ালু আল্লাহ্‌র নামে (শুরু করছি)।",
        "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
        "সমস্ত প্রশংসা আল্লাহ্‌র জন্য, যিনি সৃষ্টিকুলের মালিক। (১)",
        "الرَّحْمَٰنِ الرَّحِيمِ",
        "যিনি পরম করুণাময় ও অসীম দয়ালু। (২)",
        "مَالِكِ يَوْمِ الدِّينِ",
        "যিনি বিচার দিবসের মালিক। (৩)",
        "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ",
        "আমরা শুধু তোমারই ইবাদত (আনুগত্য) করি এবং শুধু তোমার কাছেই সাহায্য চাই। (৪)",
        "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ",
        "আমাদেরকে দেখাও সরল-সঠিক পথ। (৫)",
        "صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ",
        "তাদের পথ যাদেরকে তুমি অনুগ্রহ করেছ। (৬)",
        "غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ",
        "তাদের পথ নয় যারা তোমার ক্রোধের শিকার এবং তাদেরও নয় যারা পথভ্রষ্ট। (৭)",
        "এই ৭টি আয়াতই রয়েছে আল-কুরআনের এই সূরায়। আমাদের দৈনন্দিন ৫ বার সালাতের সময়ে আমরা এই সূরাটি পাঠ করে থাকি। কিন্তু সূরাটির ভাবার্থ অনেক বিস্তৃত। তাই এই বিষয় নিয়ে কিছু বলা যাক এবার। আমাদের সৃষ্টিকর্তা আমাদেরকে যে কতো অনুগ্রহ করেছেন তা বলে শেষ করা যাবে না। আল-কুরআন শুরুই হয়েছে তাই আল্লাহ তাআলার প্রশংসার মাধ্যমে। যিনি আমাদের এতো সুন্দর করে সৃষ্টি করলেন, এরপর অগণিত অনুগ্রহে আমাদের জীবনটাকে ভরপুর করে দিলেন, তার জন্যই সকল প্রশংসা। ",
        "(الْحَمْدُ) শব্দটার অর্থ হলো সমস্ত প্রশংসা। সমস্ত প্রশংসা আল্লাহ তাআলারই যিনি এই সৃষ্টিকুলের প্রতিপালক। তিনি পরম করুণাময়, তিনি অসীম দয়ালু। তিনি বিচার দিনের মালিক। মৃত্যুর পরে আমাদের কাছে আমাদের পৃথিবীতে কৃতকর্মের হিসাব নেওয়া হবে। এই বিচার নেবার মুহূর্ত কিন্তু কোনো সহজ বিষয় নয়, বরং অনেক কঠোরতা এবং পুঙ্খানুপুঙ্খভাবে এই হিসাব গ্রহন করা হবে। তবে এর আগে আল্লাহ আমাদের বলেছেন যে তিনি পরম করুণাময়, তিনি অসীম দয়ালু। তিনি বিচার দিনের অধিপতি, তবে তার পূর্বে তিনি দয়ালু। এই বিষয়টি অত্যন্ত গুরুত্বপূর্ণ। কঠোরতার পূর্বে দয়া, এটি আল্লাহ্‌র বিশেষ গুণ। কিন্তু এখন মনে হতে পারে, আল্লাহ কি শুধু দয়াই করেন? এইটুকুই কি তার সীমাবদ্ধতা? এর উত্তর আল্লাহ আগেই দিয়ে দিয়েছেন। সমস্ত প্রসংশা আল্লাহ্‌র জন্য, যিনি সৃষ্টিকুলের প্রতিপালক। তিনি তো দয়া করার পূর্বে আমাদের প্রতিপালন করছেন। প্রতিপালন মানে যত্ন করা, বৃদ্ধি করে তোলা। যেমনটি আমাদের পিতা-মাতা অথবা অভিভাবকেরা করে থাকেন। কিন্তু আল্লাহ্‌র প্রতিপালন আরো বিস্তৃত, আরো ব্যাপক। তিনি পুরো সৃষ্টিজগতেরই প্রতিপালন করছেন। যার এতো এতো অনুগ্রহ, তারই জন্য তো হওয়া উচিৎ সকল প্রশংসা! এরপরের আয়াতগুলোতে আল্লাহ্‌র কাছে আমরা কী চেয়ে থাকি তা বলা হয়েছে। আমাদেরকে সরল-সঠিক পথ দেখাও, যেই পথে থাকলে আমরা তাদের অন্তর্ভুক্ত হবো, যারা তোমার অনুগ্রহ পেয়েছে এবং তাদের পথ থেকে বেঁচে থাকতে পারবো, যাদের উপর তুমি ক্রোধান্বিত এবং যারা পথভ্রষ্ট।",
        "আল-কুরআন যখন অবতীর্ণ হচ্ছিল, তখন ছিল সাহিত্যের যুগ। তখন আরবি সাহিত্য পৃথিবীতে সবচেয়ে গুরুত্বপূর্ণ এবং প্রসিদ্ধ ছিল। আল-কুরআন তখন এই আরবি সাহিত্যকেও হারিয়ে দিল। সূরা ফাতিহাও এই সাহিত্যিক অলঙ্কার বহন করে রয়েছে। কীভাবে? সূরা ফাতিহার আয়াতগুলোকে যদি আমরা ২ ভাগে ভাগ করি, তাহলে এর প্রথম অংশে ১-৩ আয়াত এবং দ্বিতীয় অংশে ৫-৭ আয়াতগুলো পরবে। ৪ নম্বর আয়াতটি মাঝে থেকে উভয় অংশের প্রতিনিধিত্ব করে। তো কীভাবে চতুর্থ আয়াতটি এই প্রতিনিধিত্ব করছে? আমরা যদি প্রথম ৩টি আয়াত এবং চতুর্থ আয়াতটির প্রথমাংশ খেয়াল করি, তাহলে দেখব যে সেখানে বলা হচ্ছে,",
        "৪.১। আমরা শুধু তোমারই আনুগত্য করি।",
        "আমরা শুধুমাত্র কার আনুগত্য করি? <br> সমস্ত প্রসংশা যার এবং যিনি সৃষ্টিকুলের প্রতিপালক। (আয়াত ১)",
        "আমরা শুধুমাত্র কার আনুগত্য করি? <br> যিনি পরম করুণাময় এবং অসীম দয়ালু। (আয়াত ২)",
        "আমরা শুধুমাত্র কার আনুগত্য করি? <br> যিনি বিচার দিনের মালিক। (আয়াত ৩)",
        "এবার দ্বিতীয় অংশটি দেখা যাক।",
        "৪.২। আমরা শুধুমাত্র তোমার কাছেই সাহায্য চাই।",
        "আমরা তোমার কাছে কী সাহায্য চাই? <br> যাতে আমরা সরল-সহজ পথে চলতে পারি। (আয়াত ৫)",
        "আমরা তোমার কাছে কী সাহায্য চাই? <br> যাতে আমরা তাদের পথে চলতে পারি, যারা তোমার অনুগ্রহপ্রাপ্ত। (আয়াত ৬)",
        "আমরা তোমার কাছে কী সাহায্য চাই? <br> যাতে তাদের পথ থেকে বেঁচে থাকতে পারি, যাদের উপর তোমার ক্রোধ রয়েছে এবং যারা পথভ্রষ্ট। (আয়াত ৭)",
        "ব্যাপারটি নিশ্চয়ই দারুন, তাইনা? আল্লাহ তাআলা আমাদের এই বাসভূবনকে যেভাবে সুন্দর করে সাজিয়েছেন ঠিক সেভাবেই আল-কুরআনকেও সূক্ষ্ম ও সুন্দরভাবে জ্ঞান ও প্রজ্ঞা দ্বারা পরিপূর্ণ করে দিয়েছেন।",
        "> وَالْقُرْآنِ الْحَكِيمِ <br><br> \n > \"শপথ, জ্ঞানগর্ভ কুরআনের।\" <br> (ইয়াসিন ৩৬:২)",
        "---",
        "আশ্চর্যজনক হলেও সত্য, একটি হাদিসে কুদসিতে এই বিষয়ে বলা হয়েছে। প্রত্যক্ষভাবে নয়, আরো সুন্দর দৃষ্টিভঙ্গি থেকে এই বিষয়টি বলা হয়েছে। জামি আত-তিরমিযির ২৯৫৩ নম্বর হাদিসটি (ইসলামিক ফাউন্ডেশন বাংলাদেশ) এরকম:",
        "আবূ হুরায়রা (রা:) বলেন, <br> আমি রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছি যে,",
        "আল্লাহ তাআলা ইরশাদ করেন: আমি সালাত (সূরা ফাতিহা)-কে আমার ও আমার বান্দার মাঝে ২ ভাগে অর্ধাঅর্ধি বিভক্ত করে দিয়েছি। তার অর্ধেক আমার আর অর্ধেক আমার বান্দার। আর আমার বান্দারা যা চাইবে তাই পাবে।",
        "বান্দা সালাতে দাঁড়িয়ে বলে: সমস্ত প্রশংসা আল্লাহ্‌র জন্য, যিনি সৃষ্টিকুলের মালিক। (আয়াত ১) <br> তখন আল্লাহ তাআলা বলেন: আমার বান্দা আমার প্রশংসা করেছে।",
        "বান্দা বলে: যিনি পরম করুণাময় এবং অসীম দয়ালু। (আয়াত ২) <br> আল্লাহ বলেন: আমার বান্দা আমার গুণগান বর্ণনা করেছে।",
        "বান্দা বলে: যিনি বিচার দিনের অধিপতি। (আয়াত ৩) <br> আল্লাহ বলেন: আমার বান্দা আমার মর্যাদা দিয়েছে। এতটুকু হল আমার। আমার এবং আমার বান্দার মাঝে হল, \"আমরা শুধু তোমারই আনুগত্য করি এবং শুধু তোমার কাছেই সাহায্য চাই।\" (আয়াত ৪) সূরার শেষ অংশ হল আমার বান্দার। বান্দা আমার কাছে যা চাইবে তাই পাবে।",
        "বান্দা বলে: \"আমাদেরকে দেখাও সরল-সঠিক পথ। তাদের পথ যাদেরকে তুমি অনুগ্রহ করেছ। তাদের পথ নয় যারা তোমার ক্রোধের শিকার এবং তাদেরও নয় যারা পথভ্রষ্ট।\" (আয়াত ৫-৭) <br> আল্লাহ তখন বলেন: আমার বান্দা যা চেয়েছে তা সে পাবে।",
        "মূল হাদিসটি এখানেই শেষ। কিন্তু এই হাদিসটি কী তথ্য আমাদেরকে দিল? হ্যাঁ, আমরা এটা জানতে পারলাম যে, আমরা যখন সালাতে আল্লাহ্‌র সামনে দাড়াই এবং সূরা ফাতিহা পাঠ করি, তখন প্রতিটি আয়াত পাঠ করার পরপরই আল্লাহ আমাদের কথার জবাবা দেন! ভাবা যায়? এই মহাবিশ্বের সৃষ্টিকর্তা নিজেই আমার কথার উত্তর দিচ্ছেন! এতোই করুণা ও দয়া করেছেন আমাদের প্রতিপালক!",
        "হ্যাঁ, অনুগ্রহ দ্বারা পরিপূর্ণ আমাদের জীবন। এই অনুগ্রহের কৃতজ্ঞতা ও স্বীকারোক্তি করার জন্য আমাদের উচিৎ অনুগ্রহকারীর যথাযথ প্রশংসা করা এবং তার আদেশ-নিষেধসমূহ মেনে চলা। যেই মহাগ্রন্থ আমাদের জন্য মহাজ্ঞান ও প্রজ্ঞার আধার হিসেবে প্রেরণ করেছেন, তা পাঠ করা, তাকে উপলব্ধি করা এবং তার বিধিনিষেধগুলো মেনে নিজের জীবনে বাস্তবায়ন করা। একটুখানি ত্যাগ, একটুখানি বিসর্জনই পারে পরকালীন মুক্তি ও পরকালের সেই অসীম সুখ পাবার রাস্তাকে। আল্লাহ আমাদের নিজেদের জীবনে সর্বদা আল্লাহ্‌র আদেশ-নিষেধসমূহ বাস্তবায়ন এবং মনে সর্বদা আল্লাহ্‌র ভয় রাখার তাউফিক দান করুক, আল্লাহুম্মা আমীন।",
        "> أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ أَمْ عَلَىٰ قُلُوبٍ أَقْفَالُهَا <br><br> \n > \"তারা কি আল-কুরআনকে অনুধাবন করে না? নাকি তাদের অন্তর তালাবদ্ধ?\" <br> (মুহাম্মাদ ৪৭:২৪)",
        "---"
      ],
      "slug": "সেই-মহাগ্রন্থটির-প্রারম্ভিকা",
      "author": ["Muhammad Nazmus", "Saqib"]
    },
    {
      "title": "তাহারা সফলকাম",
      "body": [
        "সফলতা। ক্ষণস্থায়ী এই পৃথিবীতে সফলতা বলতে আমরা বুঝি যে কোনো ক্ষেত্রে কাঙ্ক্ষিত বস্তু বা বিষয়টি অর্জন করা। এতোদিন যাবত আমি একটি জিনিস পাওয়ার পেছনে ছুটতাম, স্বপ্ন দেখতাম যে আমি সেটা পাবো, পরে একসময় তা পেয়ে গেলেই তাকে আমরা সফলতা বলি। পরীক্ষায় সফলতা, কর্মক্ষেত্রে সফলতা প্রভৃতি বিষয়গুলোই আমাদের পার্থিব সফলতা। কিন্তু এই স্বল্প সময়ের সফলতা আমাদেরকে কি সর্বাবস্থায় শান্তিতে রাখতে সক্ষম? এমন কোনো ক্ষেত্রে কি সফলতা অর্জন সম্ভব নয়, যার পরে আর কখনো আমাদের দুঃখ হবে না এবং অন্যকোনো ক্ষেত্রে আর সফলতা অর্জনের প্রয়োজন হবে না? এই পার্থিব সফলতা ক্ষণিক সময়ের জন্যই আমাদেরকে শান্তি দিতে পারে। এরপরই আমরা ছুটে চলি আরেক সফলতা অর্জনের পেছনে! পরকালে অনন্ত সুখ ও অসীম নিয়ামতের মধ্যে বাস করার জন্য আমাদেরকেও সফল হতে হবে। এই সফলতা অর্জনের পরে আমাদেরকে আর কখনো আর কোনো সফলতার পেছনে ছুটতে হবে না। কিন্তু এই সফলতা চেষ্টা ও পরিশ্রমের মাধ্যমে অর্জন করা যায় না। এর মানে এটাও নয় যে কোনো পরিশ্রম ছাড়াই এই সফলতা অর্জন করা সম্ভব। না, পরিশ্রম আমাদের করে যেতেই হবে, আল্লাহ তাআলাই আমাদেরকে এই সফলতা দান করবেন। এই ব্যাপারেই আজকে কিছু লিখবার ইচ্ছা করছি। আল্লাহ আমার সহায় হোন।",
        "আল্লাহ তাআলার বাণী,",
        "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
        "পরম করুণাময় ও অসীম দয়ালু আল্লাহ্‌র নামে (শুরু করছি)।",
        "قَدْ أَفْلَحَ الْمُؤْمِنُونَ",
        "ইমানদাররা সফলকাম হয়েছে। (১)",
        "الَّذِينَ هُمْ فِي صَلَاتِهِمْ خَاشِعُونَ",
        "যারা তাদের সালাতে বিনিত, নম্র। (২)",
        "وَالَّذِينَ هُمْ عَنِ اللَّغْوِ مُعْرِضُونَ",
        "যারা অসার কর্মকান্ড থেকে বিমুখ থাকে। (৩)",
        "وَالَّذِينَ هُمْ لِلزَّكَاةِ فَاعِلُونَ",
        "যারা যাকাত প্রদান করে থাকে। (৪)",
        "وَالَّذِينَ هُمْ لِفُرُوجِهِمْ حَافِظُونَ",
        "যারা নিজেদের লজ্জাস্থানকে সংযত রাখে। (৫)",
        "إِلَّا عَلَىٰ أَزْوَاجِهِمْ أَوْ مَا مَلَكَتْ أَيْمَانُهُمْ فَإِنَّهُمْ غَيْرُ مَلُومِينَ",
        "তবে তাদের স্ত্রী ও মালিকানাভুক্ত দাসীদের ক্ষেত্রে সংযত না রাখলে তারা তিরষ্কৃত হবে না। (৬)",
        "فَمَنِ ابْتَغَىٰ وَرَاءَ ذَٰلِكَ فَأُولَٰئِكَ هُمُ الْعَادُونَ",
        "অতঃপর কেউ এদেরকে ছাড়া অন্য কাউকে কামনা করলে তারা সীমালঙ্ঘনকারী হবে। (৭)",
        "وَالَّذِينَ هُمْ لِأَمَانَاتِهِمْ وَعَهْدِهِمْ رَاعُونَ",
        "যারা আমানত ও অঙ্গীকার সম্পর্কে হুশিয়ার থাকে। (৮)",
        "وَالَّذِينَ هُمْ عَلَىٰ صَلَوَاتِهِمْ يُحَافِظُونَ",
        "যারা তাদের সালাতসমূহের হেফাযত করে। (৯)",
        "أُولَٰئِكَ هُمُ الْوَارِثُونَ",
        "তারাই উত্তরাধিকারী। (১০)",
        "الَّذِينَ يَرِثُونَ الْفِرْدَوْسَ هُمْ فِيهَا خَالِدُونَ",
        "যারা ফিরদাউসের উত্তরাধিকার লাভ করবে। তারা তাতে চিরকাল থাকবে। (১১)",
        "(মুমিনুন ২৩:১-১১)",
        "ইমানদাররা সফলকাম হয়েছে। তারা সফলতা অর্জন করেছে এবং সফলতার উপরই আছে। ইবনে আব্বাস (রা) বলেন, আয়াতের অর্থ হচ্ছে, যারা তাওহীদের সভ্যতায় বিশ্বাসী হয়েছে এবং জান্নাতে প্রবেশ করেছে তারা সফলকাম হয়েছে। কিন্তু এই ইমানদার কারা আবার? ইমানদারকে আরেক ভাষায় মুমিন বলা যায়। যারা মহান আল্লাহ, ফেরেশতাগণ, তার প্রেরিত কিতাবসমূহ ও রাসূলগণ, আখিরাত ও তাকদিরের ভালো-মন্দের উপর অন্তরে বিশ্বাস স্থাপন করেছে, মুখে স্বীকার করেছে ও আল্লাহ্‌র দেওয়া নির্দেশ অনুযায়ী নিজের জীবন বাস্তবায়ন করেছে, তাদেরকেই মুমিন বলা হবে। কিন্তু উক্ত সূরায় আল্লাহ তাআলা মুমিনের আরও কিছু গুণাগুণ ও বৈশিষ্ট্য উল্লেখ করেছেন। বৈশিষ্ট্যগুলো আল্লাহ একের পর এক উল্লেখ করেছেন।",
        "> قَدْ أَفْلَحَ الْمُؤْمِنُونَ <br><br> \n > ইমানদাররা সফলকাম হয়েছে। (মুমিনুন ২৩:১)",
        "---",
        "মুমিনগণ সফলকাম হয়েছে, যারা নিজেদের সালাতে অত্যন্ত বিনয়ী, অত্যন্ত নম্র। সালাত আদায়ের সময় খুশূ-খুদূ তথা আন্তরিক স্থিরতা ও বিনয় এবং শারীরিকভাবেও নম্র থাকা সফলতা লাভে আগ্রহী ইমানদারের প্রথম বৈশিষ্ট্য। সফলতা লাভ করার প্রথম শর্ত হিসেবে আল্লাহ তাআলা বললেন সালাতে বিনীত থাকার কথা বললেন। পার্থিব কোনো সফলতার ক্ষেত্রে আমরা আমাদের উর্ধতন মানুষ তথা যাদের মাধ্যমে আমার সফলতা আসতে পারে তাদের কাছে কতটা বিনয়ী ও নম্র থাকি। চূড়ান্ত সফলতার ক্ষেত্রেও তার ব্যতিক্রম নয়। অত্যন্ত বিনয়, নম্রতা ও ভদ্রতার সাথে আমাদের রাবের সামনে আমাদেরকে দন্ডায়মান হতে হবে। এর ফলে আমরা যেভাবে আমাদের রাবের অনুগত থাকতে পারবো, সেভাবে তাকে ভালোভাবে চিনতে ও বুঝতে পারাও আমাদের জন্য সহজ হয়ে যাবে। আবূ হুরায়রা (রা) থেকে বর্ণিত। রাসূলুল্লাহ্‌ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন: কিয়ামতের দিন বান্দার থেকে সর্বপ্রথম সালাতের হিসাব নেয়া হবে। সালাত পুরোপুরি আদায় করে থাকলে তো ভাল কথা, অন্যথায় আল্লাহ তাআলা বলবেন, দেখ, আমার বান্দার কোন নফল সালাত আছে কি না? নফল সালাত থাকলে বলবেন, এই নফল সালাত দ্বারা ফরয সালাত পূর্ণ করে দাও। (সুনান নাসাঈ:৪৬৮)",
        "দ্বিতীয় গুণটি হলো, তারা অসার কর্মকান্ড থেকে নিজেদের বিরত রাখবে। অসার তথা অপ্রয়োজনীয়, অশ্লীল ও অনর্থক কথা-বার্তা ও কাজকর্ম থেকে নিজেকে বিরত রাখা অত্যন্ত গুরুত্বপূর্ণ। পার্থিব জীবনে সফলতা লাভের জন্য আমাদের যেভাবে এই সকল কাজকর্ম থেকে বিরত থাকতে বলা হয়, সেভাবেই আমাদেরকে অনন্তকালের সফলতা লাভের জন্যও একইভাবে সেসব থেকে বিরত থাকতে হবে। আল্লাহ তাআলা এইসকল কাজে অসন্তুষ্ট হন। তাই, এইসব কাজ থেকে নিজেদেরকে বিরত রাখার মাধ্যমে একদিকে আল্লাহ্‌র সন্তুষ্টি লাভ করতে পারবো, অপরদিকে সফলকাম হবার দ্বিতীয় গুণটিও অর্জন করতে পারবো। আল্লাহ তাআলা বলেন,",
        "وَمِنَ النَّاسِ مَنْ يَشْتَرِي لَهْوَ الْحَدِيثِ لِيُضِلَّ عَنْ سَبِيلِ اللَّهِ بِغَيْرِ عِلْمٍ وَيَتَّخِذَهَا هُزُوًا ۚ أُولَٰئِكَ لَهُمْ عَذَابٌ مُهِينٌ",
        "একশ্রেণীর লোক আছে যারা মানুষকে আল্লাহর পথ থেকে গোমরাহ করার উদ্দেশে অবান্তর কথাবার্তা সংগ্রহ করে অন্ধভাবে এবং উহাকে নিয়ে ঠাট্টা-বিদ্রূপ করে। এদের জন্য রয়েছে অবমাননাকর শাস্তি। (লুকমান ৩২:৬)",
        "যারা যাকাত প্রদান করে থাকে। ইসলামের মৌলিক বিষয়সমূহের মধ্যে যাকাতের অবস্থানও উল্লেখযোগ্য। অনেক আয়াতে সালাতের পরেই যাকাতের কথা উল্লেখ করেছেন আল্লাহ তাআলা। আল্লাহ তাআলা বলেন,",
        "وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَأَطِيعُوا الرَّسُولَ لَعَلَّكُمْ تُرْحَمُونَ",
        "সালাত কায়েম কর, যাকাত প্রদান কর এবং রাসূলের আনুগত্য কর যাতে তোমরা অনুগ্রহ প্রাপ্ত হও। (নূর ২৪:৫৬)",
        "তাছাড়া আরও অনেক আয়াতেই যাকাতের গুরুত্ব উল্লেখ করা হয়েছে। পূর্ণ এক বছর কারও কাছে নিসাব (একটি নির্দিষ্ট) পরিমাণ সম্পদ থাকলে তাকে বছরের যেকোনো সময় মোট সম্পদের আড়াই শতাংশ (২.৫%) আল্লাহ্‌র সন্তুষ্টি কামনা করে (তাওবা ৯:৬০) এ উল্লেখিত খাতসমূহে খরচ করতে হবে। এটিই যাকাত। এখন, সফলতা লাভের জন্য তো কিছু ত্যাগ করাও উচিৎ, তাই না? এই যাকাতের মাধ্যমে আমরা এই ত্যাগ করতে পারবো, সাথে আমাদের রবের আনুগত্য করার মাধ্যমে তার সন্তুষ্টিও অর্জন করতে পারবো।",
        "যারা নিজেদের লজ্জাস্থানকে সংযত রাখে। তবে তাদের স্ত্রী ও মালিকানাভুক্ত দাসীদের ক্ষেত্রে সংযত না রাখলে তারা তিরষ্কৃত হবে না। অতঃপর কেউ এদেরকে ছাড়া অন্য কাউকে কামনা করলে তারা সীমালঙ্ঘনকারী হবে। এই বিষয়ে লেখকের চেয়ে পাঠকের জ্ঞান অধিক। একটু চোখ কান খোলা রাখলেই দেখা যাবে। আমি শুধু একটি হাদিস বলতে চাই, সাহল ইবনু সা'দ (রা) হতে বর্ণিত। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন: যে ব্যক্তি তার দু'চোয়ালের মাঝের বস্তু (জিহ্বা) এবং দু'রানের মাঝখানের বস্তু (লজ্জাস্থান) এর জামানত আমাকে দিবে, আমি তার জান্নাতের যিম্মাদার। (সহিহ বুখারী:৬৪৭৪)",
        "যারা আমানত ও অঙ্গীকার সম্পর্কে হুশিয়ার থাকে। পার্থিব কোনো সফলতা অর্জনের জন্য আমরা সবসময় সৎ ও বিনয়ী থাকার চেষ্টা করি। কথা দিয়ে সেই কথা রাখাকে অঙ্গীকার ও কেউ আমার কাছে কোনো কিছু (এটি যেকোনো কিছু হতে পারে, কথাও অন্তর্ভুক্ত) রাখলে তার যথাযথ সংরক্ষণ করা ও চাওয়া মাত্র তাকে তা ফেরত দিতে পারাকে আমানত বলে। মূল কথায় বিশ্বস্ততাকেই বিস্তারিতভাবে আমানত ও অঙ্গীকার রক্ষা করা বোঝায়। সেই সফলকাম হতে পারবে, যে এই বিশ্বস্ততা তার সারা জীবনে প্রয়োগ করতে পারবে। যে এই বিশ্বস্ততার পরিচয় দিতে ব্যর্থ হবে, তার কোনো সম্মানই থাকবে না। আবূ হুরায়রা (রা) থেকে বর্ণনা করেন, রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন: মুনাফিকের আলামত তিনটি: <br>",
        "১. যখন কথা বলে মিথ্যা বলে <br>",
        "২. যখন ওয়াদা করে ভঙ্গ করে এবং <br>",
        "৩. আমানত রাখা হলে খেয়ানত করে। (সহিহ বুখারী:৩২)",
        "তাছাড়া আরও একটি হাদিস এরকম, আবদুল্লাহ‌ ইবনু 'আমর (রা) থেকে বর্ণিত, নাবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন: চারটি স্বভাব যার মধ্যে থাকে সে হবে খাঁটি মুনাফিক। যার মধ্যে এর কোন একটি স্বভাব থাকবে, তা পরিত্যাগ না করা পর্যন্ত তার মধ্যে মুনাফিকের একটি স্বভাব থেকে যায়। <br>",
        "১. আমানত রাখা হলে খেয়ানত করে <br>",
        "২. কথা বললে মিথ্যা বলে <br>",
        "৩. চুক্তি করলে ভঙ্গ করে এবং <br>",
        "৪. বিবাদে লিপ্ত হলে অশ্লীল গালি দেয়। (সহিহ বুখারী:৩৩)",
        "যারা তাদের সালাতসমূহের হেফাযত করে। আচ্ছা এই কথা ২ বার কেন বলা হলো? আগের বারে বলা হয়েছে সালাতে খুশূ-খুদূ তথা বিনীত ও নম্র থাকার কথা। কিন্তু এইবার সেই সালাতসমূহের হেফাযত (সংরক্ষণ) এর কথা বলা হচ্ছে। যথাসময়ে সালাত আদায়, সালাতে আল্লাহ্‌র নিকট মনের কথা খুলে বলা, কায়মনোবাক্যে তার নিকট ক্ষমা প্রার্থনা করা এবং এই সালাতে বিনয় ও নম্রতা প্রকাশের কথা বলা হয়েছে এই আয়াতে। তাছাড়া দৈনিক পাঁচ বার সালাতই নয়, এই আয়াতের অর্থ আরও ব্যাপক। صَلَّىٰ (2nd derived form of the verb صَلِيَ) এর আভিধানিক অর্থ: প্রার্থনা (ইবাদত) করা, দোয়া করা, অনুগ্রহ করা, সালাত আদায় করা ইত্যাদি। [সূত্র: কুরআ'নীয় অভিধান, মুহাম্মদ ইয়াহিয়া, পৃষ্ঠা ১১৮](http://muhammadyeahia.com/pdf/Qura%27niya%20Avidhan.pdf) তাহলে দেখা যাচ্ছে যে, আয়াতটির অর্থ শুধু পাঁচ বার সালাতই নয়, বরং আমাদের সারাজীবনের ইবাদতের দিকটিও ইঙ্গিত করছে। তাছাড়া অনুগ্রহের ব্যাপারটিও চলে আসছে আয়াতটিতে। আল্লাহ্‌র আনুগত্য ও সারাজীবন একমাত্র তার সন্তুষ্টির মধ্যেই তো চূড়ান্ত সফলতা নিহিত থাকার কথা। বাস্তবতাও তাই বলে। পরীক্ষায় সফল হবার জন্য সারাবছরের জন্য নির্ধারিত সিলেবাস অনুসারে লেখাপড়া করতে হয়। কর্মক্ষেত্রে সফলতার জন্য উচ্চপদস্থ কর্মকর্তাদের আনুগত্য করতে হয়। পরকালের এই সফলতার জন্যও তো তাহলে সেই মহান রাবেরই আনুগত্য ও ইবাদত করা উচিৎ, তাই না?",
        "এতক্ষণ শুধু আখিরাতের ক্ষেত্রে সফলতার কথা বললেও, কেউ যদি এই আয়াতগুলোর আলোকে নিজের জীবন পরিচালনা করতে পারে, তাহলে সে এই পার্থিব জীবনে যেভাবে সফলকাম হবে, ঠিক সেভাবে পরকালেও সফল হবে, যদি আল্লাহ চান। সমস্ত কিছুর উপর আল্লাহ্‌র ক্ষমতা রয়েছে। তাই সফলতা প্রদানের একমাত্র মালিক আল্লাহ। আল্লাহ তাআলা আমাদেরকে এই পার্থিব সকল কল্যান ও পরকালীন কল্যান দান করুন এবং জীবনে সফলকাম হবার তাউফিক দান করুন, আমীন।",
        "> أُولَٰئِكَ هُمُ الْوَارِثُونَ - الَّذِينَ يَرِثُونَ الْفِرْدَوْسَ هُمْ فِيهَا خَالِدُونَ  <br><br> \n > তারাই উত্তরাধিকারী। যারা ফিরদাউসের উত্তরাধিকার লাভ করবে। তারা তাতে চিরকাল থাকবে। <br> (মুমিনুন ২৩:১০-১১)",
        "--- "
      ],
      "slug": "তাহারা-সফলকাম",
      "author": ["Muhammad Nazmus", "Saqib"]
    },
    {
      "title": "The World We Know, Or Do We?",
      "body": [
        "It's 1887. Physics is almost complete. We almost know enough to see the clockwork of the universe. Only one last great question remains. The question of the Aether wind. The question of the way light travels.",
        "Two men are setting up a set of mirrors deep inside a basement of a dormitory in Case Western. Their strange apparatus sits on a monumental block of sandstone resting on top of a pool of mercury. They are about to perform one of the most important experiment of all time. The Michleson Morley experiment. They are looking for proof of the great invisible fluid, Aether, through which light flows.",
        "At the time, light was largely assumed to be a wave like sound or wave of water. But unlike any other waves, light travels through vacuum and needs no medium to travel. Experiments after experiments showed that light needs no medium to travel which was impossible for a wave. To answer this, scientists came up with a theory of some giant incompressable invisible fluid that filled the dark between the stars and subsumed the voids between the worlds which they named Aether and it was through this liquid light moves. But as physics got more and more advanced, we had to assign wilder components to it. But still there was no better explanations than it, the idea of Aether served as the working theorem for most scientific world.",
        "The Michleson-Morley experiment was precise enough to show the effect of the speed of earth on speed of light. Unfortunately the earth moves very slow compared to the speed of light which made this a pretty challenging thing to test. Hence them burying the experiment underground, resting it on mercury and placing limestone on that mercury, they would need to measure something so small that they couldn't have any wayward tremors messing up their results, even as they adjusted their experiment and spun it around. But, and this is one of the triumphs of experimental physics, THEY DID IT! Their experiment was so exact that it was hard to dispute that it should be able to pick up the affects of the Aether wind. Only... it didn't. There was none. They got no effect at all. Light moved at the same speed no matter how they turned their device, no matter when they took the reading. It was astonishing. The experiment took place countless time by different scientists hoping for a different result and countless times it was just to prove the non-existence of the great Aether wind.",
        "This experiment threw science into chaos. What could the explanation possibly be? How could we make sense of this? In 1905, a young man named Einstein would propose a solution. He offered the solution with the term 'Special Relativity' which denies the existence of an absolute frame of reference in Physics, aka The Aether. This lead to a number of conclusions:",
        "> 1. The speed of light in vacuum is constant \n > 2. It isn't affected by a frame of reference \n > 3. Space and Time is a one contiguous thing",
        "---",
        "But this theory suggested something else, something stranger than the idea that space and time was One. This is the idea that space time might be curved. And the curvature of the space-time might be affected by gravity.",
        "And its that curvature of space-time, and the way those curves get warped and changed is what suggests that we might not live in an Euclidean Universe. We might use Euclidean geometry to explain what we see around us and solve problems regarding those, but it doesn't represent the world as it actually is. The Non-Euclidean strange geometries are much closer to the truth. They are far more accurate representation of the universe as we now understand it. And it is those 'bizarre' geometries that we use now for much of modern physics.",
        "The geometry that we built all of mathematics on, that we built all our Calculus and our Cartesian Coordinate System out of, that gave us Newtonian physics, in the end, it WASN'T IN ANY WAY REAL! It was and is simply a useful tool created by mankind to measure and think which was found to be profoundly valuable but that only MIMICKED the real world on a VERY TERRESTRIAL SCALE. When we look at something vastly large or imperceptibly small, we see that Euclidean geometry only offers us an approximation, not a precise result.",
        "Well does it mean that every scientist and discoveries we made using was wrong all the way? It doesn't. It simply tells us that our knowledge about this universe is always evolving. It means that it might be the inaccurate things that pushes us one step closer to accuracy. And most importantly, it teaches us that there is always more out there to learn and discover and we should never stop learning.",
        "---",
        "> [Some visual examples of Non-Euclidean Geometry](https://youtu.be/kEB11PQ9Eo8)"
      ],
      "slug": "the-world-we-know-or-do-we",
      "author": ["", "Abir", "Shoaib"]
    },
    {
      "title": "সোলায়মান (আঃ) ও তিমি",
      "body": [
        "সমগ্র পৃথিবীর বাদশাহ ছিলেন চার জন:",
        "1. হযরত সোলায়মান (আঃ)\n2. হযরত যুলকারনাইন (আঃ)\n3. নমরুদ ও\n4. ফিরাউন (ওয়ালিদ ইবন মুসআব)।",
        "হযরত সোলায়মান (আঃ) ছিলেন একজন নবি। তাঁর পিতার নাম হযরত দাঊদ (আঃ)। আল্লাহ্ তায়ালা হযরত সোলায়মান (আঃ) – কে পশুপাখি, জীন-পরী, কীটপতঙ্গের ভাষা বোঝার ক্ষমতা প্রদান করেন।",
        "> وَقَالَ يَا أَيُّهَا النَّاسُ عُلِّمْنَا مَنْطِقَ الطَّيْرِ وَأُوتِينَا مِنْ كُلِّ شَيْءٍ ۖ إِنَّ هَٰذَا لَهُوَ الْفَضْلُ الْمُبِينُ \n > সে (সোলায়মান) বলল : \"হে মানুষ! আমাকে পক্ষীকুলের ভাষা শিক্ষা দেওয়া হয়েছে এবং আমাকে সবকিছু (জ্ঞান) দেওয়া হয়েছে। নিশ্চয়ই এটা সুস্পষ্ট অনুগ্রহ।\" (নামল ২৭:১৬)",
        "একদা হযরত সোলায়মান (আঃ) সমগ্র সৃষ্টি জগতের একদিন রিযিকের ব্যবস্থা করার জন্য আল্লাহ্ এর অনুমতি চান। কিন্তু আল্লাহ্ হযরত সোলায়মান (আঃ) কে বললেন যে তিনি তা করতে পারবেন না। কিন্তু হযরত সোলায়মান (আঃ) হাল ছাড়লেন না। তাই আল্লাহ্ তাঁকে অনুমতি প্রদান করেন। এরপর হযরত সোলায়মান (আঃ) তাঁর অধীনস্থ সকল জীনদের সমুদ্রের পাড়ে অনেক খাবার রান্না করতে বলেন। সমুদ্র পাড় থেকে ১০০ কিলোমিটার জায়গা পর্যন্ত খাবার রান্না করা হলো। এরপর একদিন সমস্ত সৃষ্টিজগতকে নিমন্ত্রণ করে সারিবদ্ধ করা হলো। তখন হঠাৎ করে এক তিমি এসে বলল, \"আমাকে খাবার দিন,আমি খুবই ক্ষুধার্ত।\" তখন সোলায়মান (আঃ) বললেন যে,তাকে সারিতে দাঁড়াতে হবে। কিন্তু তিমি বলল, \"আমি আপনার মেহমান এবং খুবই ক্ষুধার্ত। আমি যদি ক্ষুধার জ্বালায় মৃত্যুবরণ করি তবে আল্লাহ্ আপনাকে ছাড়বেন না।\" তখন সোলায়মান (আঃ) তিমিকে খাবার দিতে বললেন। তিমিটি বলল, \"আমি মুখ খুলে রাখবো এবং যতক্ষণ মুখ বন্ধ না করি ততক্ষণ আপনার লোকেরা আমার মুখে খাবার ঢালতে থাকবে।\" তখন সোলায়মান (আঃ) বলেন, \"ঠিক আছে।\" তখন সোলায়মান (আঃ) এর লোকেরা তিমির মুখে খাবার ঢালতে থাকে। এভাবে ২০ কিলোমিটারের খাবার শেষ হয়ে যায় কিন্তু তিমির মুখ বন্ধ হয় না। এভাবে চলতে চলতে ৪০ কিলোমিটার, ৮০ কিলোমিটার এবং শেষ পর্যন্ত সকল খাবার শেষ হয়ে যায়। কিন্তু তাও তিমির মুখ বন্ধ হয় না। তখন সোলায়মান (আঃ) তিমিকে জিজ্ঞাসা করেন, \"আল্লাহ্ কী তোমাকে এর চেয়ে বেশি খাবার খাওয়ান?\" তিমি বললো, \" আল্লাহ্ আমাকে প্রতিদিন ৩ লুকমা খাবার খাওয়ান। আপনি যা খাওয়ালেন তা এর ১ লুকমারও সমান হয় নি।\" তখন সোলায়মান (আঃ) আল্লাহ্ এর মহত্ত্ব ও পবিত্রতা ঘোষণা করেন। এ কাহিনী থেকে আমরা শিখতে পারি যে, আমাদের উচিত সর্বাবস্থায় আল্লাহ্ এর শুকরিয়া আদায় করা এবং তাঁর আদেশ-নিষেধ মেনে চলা। কেননা তিনিই আমাদের সৃষ্টিকর্তা, পালনকর্তা, রিযিকদাতা ও তিনি সর্বশক্তিমান।",
        "> وَلِسُلَيْمَانَ الرِّيحَ غُدُوُّهَا شَهْرٌ وَرَوَاحُهَا شَهْرٌ \n > আমি বায়ুকে সোলায়মানের অধীন করেছিলাম। সে সকালে এক মাসের পথ অতিক্রম করত ও সন্ধ্যায় এক মাসের পথ অতিক্রম করত। (সাবা ৩৪:১২)"
      ],
      "slug": "সোলায়মান-ও-তিমি",
      "author": ["Muhammad", "Munif", "Mehbub"]
    },
    {
      "title": "নবী ইউনুস (আ:)",
      "body": [
        "আসসালামু আলাইকুম। আজকে আমি আপনাদের কাছে একটি গল্প শেয়ার করব ইন-শা-আল্লাহ। আমরা সবাই ইউনুস (আঃ) কে চিনি। তিনি একজন নবী। তার সমায়ে খুব খারাপ মানুষ ছিল। তিনি তাদের দাওয়াত দিতেন কিন্তু কেও তার কথা শুনলোনা! আর তিনি তাদের আল্লাহর আজাবের কথা বলে সাবধান করে দিলেন। তাও তারা তার কথা অমান্য করলো। তিনি আবারো তাদের আল্লাহর আজাবের কথা বলে সাবধান করে দিলেন। এবং তিনি সেখান থেকে চলে গেলেন।তখন সেখানে আজাব আসল তখন তারা আল্লাহর কাছে দুআ করতে শুরু করলো আল্লাহ তাদের মাফ করে দিলেন।",
        "তিনি মাঝ পথে একটা __সাগর__ দেখতে পেলেন। তিনি একটি জাহাজে করে যাত্রা করতে শুরু করলেন। তখন খুব ঝড় শুরু হল। তারা ভাবলো যে কেউ একজন কে ফেলে দিতে হবে। তখন লটারি করা হল যে কাকে ফেলে দিবে। পর পর চার বার ইউনুস (আঃ) এর নাম এলো। তারপর তারা ইউনুস (আঃ) কে পানিতে ফেলে দিলো। তারপর একটি বড় মাছ তাকে গিলে ফেললো। তিনি তিন দিন মাছের পেটে থাকার সময় আল্লাহর কাছে দুয়া করতে থাকেন। আল্লাহ তাকে একটি দ্বীপে রাখার বাবস্থা করলেন। মাছের পেটের \"__এসিড__\" থাকার ফলে সূর্যে তার গা পুরে যেতে  লাগলো। আল্লাহ তার জন্য একটি লাউ গাছ সেখানে তৈরি করে দিলেন। তিনি যখন সুস্থ হয়ে সেখানে গেলেন দেখলে তারা সবাই ভাল হয়ে গিয়েছে তিনি তাদের মুসলিম হওয়ার দাওয়াত দিলেন এবার তারা ইউনুস (আঃ) এর কথা শুনল এবং তারা মুসলিম হলো।"
      ],
      "slug": "নবী-ইউনুস",
      "author": ["Muhammad Nazmus", "Saadat"]
    }
  ],
  "projects": [
    {
      "title": "Saqib",
      "href": "https://saqib.ml",
      "name": "saqib.ml",
      "author": ["Muhammad Nazmus", "Saqib"],
      "technologies": ["React", "Framer Motion"]
    },
    {
      "title": "Choclacode",
      "href": "http://choclacode.eu.org",
      "name": "choclacode",
      "author": ["Muhammad Nazmus", "Saqib"],
      "technologies": ["Node.js", "Express"]
    },
    {
      "title": "Task Master",
      "href": "https://flask-crud-app-tutorial-fateen.herokuapp.com",
      "name": "task-master",
      "author": ["", "Fateen", "Yusuf Mostafa"],
      "technologies": ["Python", "Flask"]
    },
    {
      "title": "Sakib",
      "href": "https://saifsaki.github.io/sakib",
      "name": "sakib",
      "author": ["", "Sakib", "Al Hasan"],
      "technologies": ["HTML"]
    },
    {
      "title": "Munif",
      "href": "http://munif.ml",
      "name": "munif.ml",
      "author": ["Muhammad Nazmus", "Saqib"],
      "technologies": ["React", "Framer Motion"]
    },
    {
      "title": "Saadat",
      "href": "http://saadat.eu.org",
      "name": "saadat.eu.org",
      "author": ["Muhammad Nazmus", "Saqib"],
      "technologies": ["HTML"]
    },
    {
      "title": "HomeNet",
      "href": "http://homenet.saqib.ml",
      "name": "homenet",
      "author": ["Muhammad Nazmus", "Saqib"],
      "technologies": ["Node.js", "Express"]
    }
  ]
}
